/*
 *  TOPPERS/FMP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Flexible MultiProcessor Kernel
 * 
 *  Copyright (C) 2000-2003 by Embedded and Real-Time Systems Laboratory
 *                              Toyohashi Univ. of Technology, JAPAN
 *  Copyright (C) 2006-2010 by Embedded and Real-Time Systems Laboratory
 *              Graduate School of Information Science, Nagoya Univ., JAPAN
 *
 *  上記著作権者は，以下の(1)〜(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 * 
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 * 
 *  @(#) $Id: sh7786_config.h 512 2010-02-01 05:33:27Z ertl-honda $
 */

/*
 *     プロセッサ依存モジュール（SH7786用）
 *
 *  このインクルードファイルは，target_config.h（または，そこからインク
 *  ルードされるファイル）のみからインクルードされる．他のファイルから
 *  直接インクルードしてはならない．
 */

#ifndef TOPPERS_SH7786_CONFIG_H
#define TOPPERS_SH7786_CONFIG_H

/*
 *  割込みハンドラ番号に関する定義
 */ 
#define TMIN_INHNO 0x1C0U
#define TMAX_INHNO 0xFE0U
#define TNUM_INH   0x080U

/*
 *  割込み番号に関する定義
 */ 
#define TMIN_INTNO 0x1C0U
#define TMAX_INTNO 0xFE0U
#define TNUM_INT   0x080U

/*
 *  割込みマスクレジスタの本数
 */
#define TNUM_MST_INFO_TBL 8

/*
 *  割込みマスクレジスタの本数
 */
#define TNUM_MAK_INFO_DATA 4

#ifndef TOPPERS_MACRO_ONLY

/*
 * 割込み要求ライン毎の優先度設定レジスタの設定情報
 */
#define IPR_INFO_TBL_DATA \
    {0U, 0},        /* 0x000(0x000) */ \
    {0U, 0},        /* 0x020(0x001) */ \
    {0U, 0},        /* 0x040(0x002) */ \
    {0U, 0},        /* 0x060(0x003) */ \
    {0U, 0},        /* 0x080(0x004) */ \
    {0U, 0},        /* 0x0A0(0x005) */ \
    {0U, 0},        /* 0x0C0(0x006) */ \
    {0U, 0},        /* 0x100(0x007) */ \
    {0U, 0},        /* 0x100(0x008) */ \
    {0U, 0},        /* 0x120(0x009) */ \
    {0U, 0},        /* 0x140(0x00A) */ \
    {0U, 0},        /* 0x160(0x00B) */ \
    {0U, 0},        /* 0x180(0x00C) */ \
    {0U, 0},        /* 0x1A0(0x00D) */ \
\
    {0U, 0},        /* 0x1C0(0x00E) NMI */ \
\
    {0U, 0},        /* 0x1E0(0x00F) */ \
\
    {0U, 0},        /* 0x200(0x010) IRL 0000 */ \
    {0U, 0},        /* 0x220(0x011) IRL 0001 */ \
    {0U, 0},        /* 0x240(0x012) IRL 0010 */ \
    {0U, 0},        /* 0x260(0x013) IRL 0011 */ \
    {0U, 0},        /* 0x280(0x014) IRL 0100 */ \
    {0U, 0},        /* 0x2A0(0x015) IRL 0101 */ \
    {0U, 0},        /* 0x2C0(0x016) IRL 0110 */ \
    {0U, 0},        /* 0x2E0(0x017) IRL 0111 */ \
    {0U, 0},        /* 0x300(0x018) IRL 1000 */ \
    {0U, 0},        /* 0x320(0x019) IRL 1001 */ \
    {0U, 0},        /* 0x340(0x01A) IRL 1010 */ \
    {0U, 0},        /* 0x360(0x01B) IRL 1011 */ \
    {0U, 0},        /* 0x380(0x01C) IRL 1100 */ \
    {0U, 0},        /* 0x3A0(0x01D) IRL 1101 */ \
    {0U, 0},        /* 0x3C0(0x01E) IRL 1110 */ \
    {0U, 0},        /* 0x3E0(0x01F) */ \
\
    {INT2PRI01, 24},  /* 0x400(0x020) TMU_0 */ \
    {INT2PRI01, 16},  /* 0x420(0x021)  */ \
    {0U, 0},          /* 0x440(0x022)  */ \
    {0U, 0},          /* 0x460(0x023)  */ \
    {0U, 0},          /* 0x480(0x024) TMU_1  */ \
    {0U, 0},          /* 0x4A0(0x025)  */ \
\
    {0U,  0},       /* 0x4C0(0x026) */ \
    {0U, 0},        /* 0x4E0(0x027) */ \
\
    {0U, 0},        /* 0x500(0x028) */ \
    {0U, 0},        /* 0x520(0x029) */ \
    {0U, 0},        /* 0x540(0x02A) */ \
    {0U, 0},        /* 0x560(0x02B) */ \
    {0U, 0},        /* 0x580(0x02C) */ \
    {0U, 0},        /* 0x5A0(0x02D) */ \
    {0U, 0},        /* 0x5C0(0x02E) */ \
    {0U, 0},        /* 0x5E0(0x02F) */ \
    {0U, 0},        /* 0x600(0x030) */ \
    {0U, 0},        /* 0x620(0x031) */ \
\
    {0U, 0},        /* 0x640(0x032)  */ \
    {0U, 0},        /* 0x660(0x033)  */ \
    {0U, 0},        /* 0x680(0x034)  */ \
    {0U, 0},        /* 0x6A0(0x035)  */ \
    {0U, 0},        /* 0x6C0(0x036)  */ \
    {0U, 0},        /* 0x6E0(0x037)  */ \
\
    {INT2PRI07, 24}, /* 0x700(0x038) SCIF-ch0 ERI0 */ \
    {INT2PRI07, 16}, /* 0x720(0x039)          RXI0 */ \
    {INT2PRI07, 8},  /* 0x740(0x03A)          BRI0 */ \
    {INT2PRI07, 0},  /* 0x760(0x03B)          TXI0 */ \
\
    {INT2PRI08, 24}, /* 0x780(0x03C) SCIF-ch1  */ \
    {0U, 0},         /* 0x7A0(0x03D)          */ \
    {0U, 0},         /* 0x7C0(0x03E)          */ \
    {0U, 0},         /* 0x7E0(0x03F)         */ \
\
    {0U, 0},         /* 0x800(0x040) */ \
    {0U, 0},         /* 0x820(0x041) */ \
    {0U, 0},         /* 0x840(0x042) */ \
    {0U, 0},         /* 0x860(0x043) */ \
\
    {0U, 0},         /* 0x880(0x044) */ \
    {0U, 0},         /* 0x8A0(0x045) */ \
    {0U, 0},         /* 0x8C0(0x046) */ \
    {0U, 0},         /* 0x8E0(0x047) */ \
\
    {0U, 0}, /* 0x900(0x048) DMINT0  DMINT0 */ \
    {0U, 0}, /* 0x920(0x049)  DMINT1 */ \
    {0U, 0}, /* 0x940(0x04A)  DMINT2 */ \
    {0U, 0}, /* 0x960(0x04B)  DMINT3 */ \
    {0U, 0}, /* 0x980(0x04C)  DMINT4  */ \
    {0U, 0}, /* 0x9A0(0x04D)  DMINT5 */ \
    {0U, 0}, /* 0x9C0(0x04E)  DMAE0 */ \
\
    {0U, 0},  /* 0x9E0(0x04F) */ \
\
    {0U, 0}, /* 0xA00(0x050) DMIN6 */ \
    {0U, 0}, /* 0xA20(0x051) DMIN7 */ \
    {0U, 0}, /* 0xA40(0x052) DMIN8 */ \
    {0U, 0}, /* 0xA60(0x053) DMIN9 */ \
    {0U, 0}, /* 0xA80(0x054) DMIN10 */ \
    {0U, 0}, /* 0xAA0(0x055) DMIN11  */ \
    {0U, 0}, /* 0xAC0(0x056) DMAE1 */ \
\
    {0U, 0}, /* 0xAE0(0x057) IIC */ \
\
    {0U, 0}, /* 0xB00(0x058) VIN_0 */ \
    {0U, 0}, /* 0xB20(0x059) VIN_1 */ \
\
    {0U, 0}, /* 0xB40(0x05A) IMP*/ \
\
    {0U, 0}, /* 0xB60(0x05B) ATA*/ \
\
    {0U, 0}, /* 0xB80(0x05C)  */ \
    {0U, 0}, /* 0xBA0(0x05D)  */ \
    {0U, 0}, /* 0xBC0(0x05E)  */ \
    {0U, 0}, /* 0xBE0(0x05F)  */ \
\
    {0U, 0}, /* 0xC00(0x060) TEND */ \
    {0U, 0}, /* 0xC20(0x061) AE  */ \
    {0U, 0}, /* 0xC40(0x062) TMISS */ \
\
    {0U, 0}, /* 0xC60(0x063) TEND */ \
    {0U, 0}, /* 0xC80(0x064) AE */ \
    {0U, 0}, /* 0xCA0(0x065) TMISS */ \
\
    {0U, 0}, /* 0xCC0(0x066) TEND*/ \
    {0U, 0}, /* 0xCE0(0x067) AE*/ \
    {0U, 0}, /* 0xC00(0x068) TMISS */ \
\
    {0U, 0}, /* 0xD20(0x069)       TEND  */ \
    {0U, 0}, /* 0xD40(0x06A)       AE   */ \
    {0U, 0}, /* 0xD60(0x06B)       TMISS  */ \
\
    {0U, 0}, /* 0xD80(0x06C)  */ \
    {0U, 0}, /* 0xDA0(0x06D) */ \
    {0U, 0}, /* 0xDC0(0x06E)   */ \
    {0U, 0}, /* 0xDE0(0x06F)   */ \
\
    {0U, 0}, /* 0xE00(0x070) FE_0 */ \
\
    {0U, 0}, /* 0xE20(0x071) FE_1 */ \
\
    {0U, 0}, /* 0xE40(0x072) GPIO_0 */ \
\
    {0U, 0}, /* 0xE60(0x073) GPIO_1*/ \
\
    {0U, 0}, /* 0xE80(0x074) GPIO_2 */ \
\
    {0U, 0}, /* 0xEA0(0x075) GPIO_3 */ \
    {0U, 0}, /* 0xEC0(0x076) PAM*/ \
\
    {0U, 0},        /* 0xEE0(0x077) */ \
\
    {C0ICIPRI, 0},  /* 0xF00(0x078) */ \
    {C1ICIPRI, 4},  /* 0xF20(0x079) */ \
    {0U, 0},        /* 0xF40(0x07A) */ \
    {0U, 0},        /* 0xF60(0x07B) */ \
\
    {0U, 0},        /* 0xF80(0x07C) */ \
    {0U, 0},        /* 0xFA0(0x07D) */ \
    {0U, 0},        /* 0xFC0(0x07E) */ \
    {0U, 0},        /* 0xFE0(0x07F) */ \


/*
 * 割込み要求ライン毎のマスククリアレジスタの設定情報
 */
#define MSKCLR_INFO_TBL_DATA \
    {0U, 0},        /* 0x000(0x000) */ \
    {0U, 0},        /* 0x020(0x001) */ \
    {0U, 0},        /* 0x040(0x002) */ \
    {0U, 0},        /* 0x060(0x003) */ \
    {0U, 0},        /* 0x080(0x004) */ \
    {0U, 0},        /* 0x0A0(0x005) */ \
    {0U, 0},        /* 0x0C0(0x006) */ \
    {0U, 0},        /* 0x100(0x007) */ \
    {0U, 0},        /* 0x100(0x008) */ \
    {0U, 0},        /* 0x120(0x009) */ \
    {0U, 0},        /* 0x140(0x00A) */ \
    {0U, 0},        /* 0x160(0x00B) */ \
    {0U, 0},        /* 0x180(0x00C) */ \
    {0U, 0},        /* 0x1A0(0x00D) */ \
\
    {0U, 0},        /* 0x1C0(0x00E) NMI */ \
\
    {0U, 0},        /* 0x1E0(0x00F) */ \
\
    {0U, 0},        /* 0x200(0x010) IRL 0000 */ \
    {0U, 0},        /* 0x220(0x011) IRL 0001 */ \
    {0U, 0},        /* 0x240(0x012) IRL 0010 */ \
    {0U, 0},        /* 0x260(0x013) IRL 0011 */ \
    {0U, 0},        /* 0x280(0x014) IRL 0100 */ \
    {0U, 0},        /* 0x2A0(0x015) IRL 0101 */ \
    {0U, 0},        /* 0x2C0(0x016) IRL 0110 */ \
    {0U, 0},        /* 0x2E0(0x017) IRL 0111 */ \
    {0U, 0},        /* 0x300(0x018) IRL 1000 */ \
    {0U, 0},        /* 0x320(0x019) IRL 1001 */ \
    {0U, 0},        /* 0x340(0x01A) IRL 1010 */ \
    {0U, 0},        /* 0x360(0x01B) IRL 1011 */ \
    {0U, 0},        /* 0x380(0x01C) IRL 1100 */ \
    {0U, 0},        /* 0x3A0(0x01D) IRL 1101 */ \
    {0U, 0},        /* 0x3C0(0x01E) IRL 1110 */ \
    {0U, 0},        /* 0x3E0(0x01F) */ \
\
    {C0INT2MSKCLR1, TMU_0_MASK},  /* 0x400(0x020) TMU_0 */ \
    {C0INT2MSKCLR1, TMU_1_MASK},  /* 0x420(0x021) TMU_1  */ \
    {0U, 0},  /* 0x440(0x022) TMU_2  */ \
    {0U, 0},  /* 0x460(0x023) TMU_3  */ \
    {0U, 0},  /* 0x480(0x024) TMU_4  */ \
    {0U, 0},  /* 0x4A0(0x025) TMU_5  */ \
\
    {0U, 0},       /* 0x4C0(0x026) */ \
    {0U, 0},        /* 0x4E0(0x027) */ \
\
    {0U, 0},  /* 0x500(0x028) PCII_0*/ \
    {0U, 0},  /* 0x520(0x029) PCII_1*/ \
    {0U, 0},  /* 0x540(0x02A) PCII_2*/ \
    {0U, 0}, /* 0x560(0x02B) PCII_3 */ \
    {0U, 0}, /* 0x580(0x02C) PCII_4 */ \
    {0U, 0}, /* 0x5A0(0x02D) PCII_5 */ \
    {0U, 0}, /* 0x5C0(0x02E) PCII_6 */ \
    {0U, 0}, /* 0x5E0(0x02F) PCII_7 */ \
    {0U, 0}, /* 0x600(0x030) PCII_8 */ \
    {0U, 0}, /* 0x620(0x031) PCII_9 */ \
\
    {0U, 0},        /* 0x640(0x032)  */ \
    {0U, 0},        /* 0x660(0x033)  */ \
    {0U, 0},        /* 0x680(0x034)  */ \
    {0U, 0},        /* 0x6A0(0x035)  */ \
    {0U, 0},        /* 0x6C0(0x036)  */ \
    {0U, 0},        /* 0x6E0(0x037)  */ \
\
    {0U, 0}, /* 0x700(0x038) SCIF-ch0 ERI0 */ \
    {C0INT2MSKCLR1, SCIF_0_RXI_MASK}, /* 0x720(0x039)          RXI0 */ \
    {0U, 0}, /* 0x740(0x03A)          BRI0 */ \
    {C0INT2MSKCLR1, SCIF_0_TXI_MASK}, /* 0x760(0x03B)          TXI0 */ \
\
    {C0INT2MSKCLR1, SCIF_1_RXI_MASK}, /* 0x780(0x03C) SCIF-ch1 ERI1 */ \
    {0U, 0}, /* 0x7A0(0x03D)         RXI1 */ \
    {0U, 0}, /* 0x7C0(0x03E)         BRI1 */ \
    {0U, 0}, /* 0x7E0(0x03F)         TXI1 */ \
\
    {0U, 0}, /* 0x800(0x040) SCIF-ch2 ERI2 */ \
    {0U, 0}, /* 0x820(0x041)          RXI2 */ \
    {0U, 0}, /* 0x840(0x042)          BRI2 */ \
    {0U, 0}, /* 0x860(0x043)          TXI2 */ \
\
    {0U, 0}, /* 0x880(0x044) SCIF-ch3 ERI3 */ \
    {0U, 0}, /* 0x8A0(0x045)          RXI3*/ \
    {0U, 0}, /* 0x8C0(0x046)          BRI3*/ \
    {0U, 0}, /* 0x8E0(0x047)          TXI3*/ \
\
    {0U, 0}, /* 0x900(0x048) DMINT0  DMINT0 */ \
    {0U, 0}, /* 0x920(0x049)  DMINT1 */ \
    {0U, 0}, /* 0x940(0x04A)  DMINT2 */ \
    {0U, 0}, /* 0x960(0x04B)  DMINT3 */ \
    {0U, 0}, /* 0x980(0x04C)  DMINT4  */ \
    {0U, 0}, /* 0x9A0(0x04D)  DMINT5 */ \
    {0U, 0}, /* 0x9C0(0x04E)  DMAE0 */ \
\
    {0U, 0},  /* 0x9E0(0x04F) DU*/ \
\
    {0U, 0}, /* 0xA00(0x050) DMIN6 */ \
    {0U, 0}, /* 0xA20(0x051) DMIN7 */ \
    {0U, 0}, /* 0xA40(0x052) DMIN8 */ \
    {0U, 0}, /* 0xA60(0x053) DMIN9 */ \
    {0U, 0}, /* 0xA80(0x054) DMIN10 */ \
    {0U, 0}, /* 0xAA0(0x055) DMIN11  */ \
    {0U, 0}, /* 0xAC0(0x056) DMAE1 */ \
\
    {0U, 0},  /* 0xAE0(0x057) IIC */ \
\
    {0U, 0},  /* 0xB00(0x058) VIN_0 */ \
    {0U, 0}, /* 0xB20(0x059) VIN_1 */ \
\
    {0U, 0}, /* 0xB40(0x05A) IMP*/ \
\
    {0U, 0}, /* 0xB60(0x05B) ATA*/ \
\
    {0U, 0},        /* 0xB80(0x05C)  */ \
    {0U, 0},        /* 0xBA0(0x05D)  */ \
    {0U, 0},        /* 0xBC0(0x05E)  */ \
    {0U, 0},        /* 0xBE0(0x05F)  */ \
\
    {0U, 0}, /* 0xC00(0x060) TEND */ \
    {0U, 0}, /* 0xC20(0x061) AE  */ \
    {0U, 0}, /* 0xC40(0x062) TMISS */ \
\
    {0U, 0}, /* 0xC60(0x063) TEND */ \
    {0U, 0}, /* 0xC80(0x064) AE */ \
    {0U, 0}, /* 0xCA0(0x065) TMISS */ \
\
    {0U, 0}, /* 0xCC0(0x066) TEND*/ \
    {0U, 0}, /* 0xCE0(0x067) AE*/ \
    {0U, 0}, /* 0xC00(0x068) TMISS */ \
\
    {0U, 0}, /* 0xD20(0x069)       TEND  */ \
    {0U, 0}, /* 0xD40(0x06A)       AE   */ \
    {0U, 0}, /* 0xD60(0x06B)       TMISS  */ \
\
    {0U, 0},        /* 0xD80(0x06C)  */ \
    {0U, 0},        /* 0xDA0(0x06D) */ \
    {0U, 0},        /* 0xDC0(0x06E)   */ \
    {0U, 0},        /* 0xDE0(0x06F)   */ \
\
    {0U, 0}, /* 0xE00(0x070) FE_0 */ \
\
    {0U, 0}, /* 0xE20(0x071) FE_1 */ \
\
    {0U, 0}, /* 0xE40(0x072) GPIO_0 */ \
\
    {0U, 0},  /* 0xE60(0x073) GPIO_1*/ \
\
    {0U, 0}, /* 0xE80(0x074) GPIO_2 */ \
\
    {0U, 0}, /* 0xEA0(0x075) GPIO_3 */ \
    {0U, 0}, /* 0xEC0(0x076) PAM*/ \
\
    {0U, 0},        /* 0xEE0(0x077) */ \
\
    {0U, 0},        /* 0xF00(0x078) */ \
    {0U, 0},        /* 0xF20(0x079) */ \
    {0U, 0},        /* 0xF40(0x07A) */ \
    {0U, 0},        /* 0xF60(0x07B) */ \
\
    {0U, 0},        /* 0xF80(0x07C) */ \
    {0U, 0},        /* 0xFA0(0x07D) */ \
    {0U, 0},        /* 0xFC0(0x07E) */ \
    {0U, 0},        /* 0xFE0(0x07F) */ \


#define CALC_CPU_MSKCLR_OFFSET(cpuindex) (cpuindex * 0x100);

/*
 *  割込み優先度レジスタの初期化
 */
Inline void
init_int2pri(void) 
{
	sil_wrw_mem((void*)INT2PRI00, 0x00000000U);
	sil_wrw_mem((void*)INT2PRI01, 0x00000000U);
	sil_wrw_mem((void*)INT2PRI02, 0x00000000U);
	sil_wrw_mem((void*)INT2PRI03, 0x00000000U);
	sil_wrw_mem((void*)INT2PRI04, 0x00000000U);
	sil_wrw_mem((void*)INT2PRI05, 0x00000000U);
	sil_wrw_mem((void*)INT2PRI06, 0x00000000U);
	sil_wrw_mem((void*)INT2PRI07, 0x00000000U);
	sil_wrw_mem((void*)INT2PRI08, 0x00000000U);
}

/*
 *  割込みマスクレジスタの初期化
 */
Inline void
init_int2msk(void)
{
	sil_wrw_mem((void *)C0INT2MSK0, 0x00000001U);
	sil_wrw_mem((void *)C0INT2MSK1, 0xFFFFFFFFU);
	sil_wrw_mem((void *)C0INT2MSK2, 0x3F0001FFU);
	sil_wrw_mem((void *)C0INT2MSK3, 0xFFFFFFFFU);

	sil_wrw_mem((void *)C1INT2MSK0, 0x00000001U);
	sil_wrw_mem((void *)C1INT2MSK1, 0xFFFFFFFFU);
	sil_wrw_mem((void *)C1INT2MSK2, 0x3F0001FFU);
	sil_wrw_mem((void *)C1INT2MSK3, 0xFFFFFFFFU);
}

#endif /* TOPPERS_MACRO_ONLY */

/*
 *  プロセッサ依存モジュール（SH4A用）
 */
#include "sh4a_gcc/prc_config.h"

#endif /* TOPPERS_SH7786_CONFIG_H */
