$ 
$		チップ依存テンプレート（SH7205用）
$ 

$ 
$  有効な割込み番号，割込みハンドラ番号，CPU例外ハンドラ番号
$ 

$ １コア分のローカルな番号を定義
$INTNO_VALID_LOCAL = {  11;12;14;
						21,22,...,28;
						64,65,...,71;
						81,82,...,87;
						102,103,...,160;
						162,163,...,222;
						226,227,...,235 }$

$EXCNO_VALID_LOCAL = {  4;6;9;13;15;16;17;18;19;
						32,33,...,63 }$

$ コア数分、展開
$INTNO_VALID = { }$
$FOREACH prcid RANGE(1, TNUM_PRCID)$
	$upper_word = prcid << 16$
	$FOREACH intno INTNO_VALID_LOCAL$
		$INTNO_VALID = APPEND(INTNO_VALID, upper_word | intno)$
	$END$
$END$

$EXCNO_VALID = { }$
$FOREACH prcid RANGE(1, TNUM_PRCID)$
	$upper_word = prcid << 16$
	$FOREACH excno EXCNO_VALID_LOCAL$
		$EXCNO_VALID = APPEND(EXCNO_VALID, upper_word | excno)$
	$END$
$END$

$INHNO_VALID = INTNO_VALID$


$ 
$  同じ割込み優先度を設定しなければならない割込み番号のリスト
$  　（-1をセパレータとする。）
$ 
$  Tips
$ 　　単純記法と等差数列記法を切り替えるときは、；で区切る。
$ 
$same_intpri_list = { 80,81,...,87;-1,
					  118,119,-1,
					  120,121,-1;
					  124,125,...,127;-1,
					  128,129,130,-1,
					  131,132,-1,
					  133,134,-1,
					  135,136,-1,
					  137,138,-1;
					  139,140,...,142;-1;
					  144,145,...,147;-1;
					  149,150,-1,
					  151,152,-1,
					  153,154,-1,
					  155,156,-1,
					  157,158,-1,
					  159,160,-1;
					  162,163,...,166;-1;
					  167,168,...,171;-1;
					  172,173,...,176;-1;
					  177,178,...,181;-1;
					  182,183,...,185;-1;
					  186,187,...,189;-1;
					  190,191,...,193;-1;
					  194,195,...,197;-1;
					  198,199,...,201;-1;
					  202,203,...,205;-1,
					  206,207,208,-1,
					  209,210,211,-1,
					  213,214,-1;
					  216,217,...,219;-1,
					  220,221,222,-1;
					  226,227,...,230;-1;
					  231,232,...,235;-1
					}$


$ 
$  コア依存のテンプレートファイルのインクルード
$ 
$INCLUDE "sh2a_dual_gcc/sh2a_dual.tf"$
